uhnp/src/InformationRegisters/СтавкиДисконтирования/СтавкиДисконтирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиДисконтирования</name>
  <comment>Дополняет учетную политику финансового учета ставками дисконтирования в разных валютах</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СтавкаДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УчетнаяПолитикаФинансовогоУчета/УчетнаяПолитикаФинансовогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаФинансовогоУчета</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МетодОценкиСтоимостиТоваров</name>
    <type>
      <types>EnumRef.МетодыОценкиСтоимостиТоваров</types>
    </type>
  </resources>
  <resources>
    <name>УчетГотовойПродукцииПоПлановойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьФормироватьРезервыПоСомнительнымДолгам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПериодичностьРезервовПоСомнительнымДолгам</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПризнаватьРасходыПоИсследованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовПоИсследованиям</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходовПоИсследованиям</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьВыделениеДолгосрочныхАктивовОбязательств</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДлительностьОперационногоЦикла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокУчетаВНА</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНА</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокУчетаВНАРегл</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНАРегл</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииОС</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииОСРегл</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииАренда</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииАрендаРегл</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииНМА</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНачисленияАмортизацииНМАРегл</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ДетализироватьМатериальныеИПостатейныеЗатратыВСебестоимостиТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетАрендыПоФСБУ25_2018</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МесяцНачалаФинансовогоГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантПроводокПоОбесценениюВНА</name>
    <comment>Начислять амортизацию на полную (не обесцененную) стоимость и сторнировать корректировку обесценения (истина) или начислять амортизацию на обесцененную стоимость и доначислять корректировку обесценения (ложь) по IAS 36</comment>
    <type>
      <types>EnumRef.ВариантыПроводокПоОбесценениюВНА</types>
    </type>
  </resources>
  <resources>
    <name>УчетДисконтированнойКредиторскойЗадолженностиПоставщикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяСписанияПроцентныхРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаСписанияПроцентныхРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СрокДляПримененияДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетДисконтированияРезервовПредстоящихРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяСписанияПроцентныхРасходовДисконтированияРезервов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаСписанияПроцентныхРасходовДисконтированияРезервов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРезервыПоСомнительнымДолгам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьРезервовПоСомнительнымДолгам</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокОценкиЗадолженности</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВосстанавливатьРезервПриСписанииЗапасовНаРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяПроцентныхДоходовФинансовойАренды</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаПроцентныхДоходовФинансовойАренды</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДоходовДляУслугФинансовойАренды</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаДоходовДляУслугФинансовойАренды</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>МетодПереоценкиОС</name>
    <type>
      <types>EnumRef.МетодыПереоценкиВНА</types>
    </type>
  </resources>
  <resources>
    <name>МетодПереоценкиНМА</name>
    <type>
      <types>EnumRef.МетодыПереоценкиВНА</types>
    </type>
  </resources>
  <resources>
    <name>ДетализироватьОтклоненияПоНаправлениямДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДетализироватьОтклоненияПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДетализироватьОтклоненияПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписыватьОтклоненияВСтоимостиПродукцииНаСебестоимостьПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеВестиДетализациюДоДокументовПоступления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СтавкиДисконтирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает актуальную ставку дисконтирования.
//
// Параметры:
//  Период - Дата - Период применяемых настроек учетной политики финансового учета .
//  Организация - СправочникСсылка.Организации - Организация договора.
//  Валюта - СправочникСсылка.Валюты - Валюта взаиморасчетов договора.
//
// Возвращаемое значение:
//  Число - Значение ставки дисконтирования по умолчанию.
//
Функция ПолучитьСтавкуДисконтированияПоУмолчанию(Период, Организация, Валюта) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(Валюта) Тогда
		Возврат 0;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ГоловнаяОрганизация"));
	Отбор.Вставить("Валюта", Валюта);
	СтруктураРесурсов = РегистрыСведений.СтавкиДисконтирования.Получить(Период, Отбор);
	
	Возврат СтруктураРесурсов.СтавкаДисконтирования;
	
КонецФункции

// Определяет массив организаций использующих дисконтирование или использовавших его ранее
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Организации - Организации 
//
Функция ПолучитьОрганизацииСВключеннымДисконтированием() Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаФинансовогоУчета КАК УчетнаяПолитикаФинансовогоУчета
		|		ПО Организации.ГоловнаяОрганизация = УчетнаяПолитикаФинансовогоУчета.Организация
		|ГДЕ
		|	УчетнаяПолитикаФинансовогоУчета.УчетДисконтированнойКредиторскойЗадолженностиПоставщикам";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Организация);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти
	
#КонецЕсли
